# 필수만. 새 맥: brew bundle --file=Brewfile  (더 쳐내거나 추가해도 됨)
tap "hamed-elfayome/claude-usage"

# CLI
brew "gh"
brew "nvm"
brew "pyenv"
brew "uv"
brew "yarn"
brew "maven"
brew "docker"
brew "zsh-autosuggestions"

# Apps
cask "iterm2"
cask "raycast"
cask "visual-studio-code"
cask "claude"
cask "obsidian"
cask "rancher"
cask "karabiner-elements"
cask "linearmouse"
cask "alt-tab"
cask "appcleaner"
cask "font-d2coding-nerd-font"
cask "font-jetbrains-mono-nerd-font"
